#include<stdio.h> 
#include<locale.h> 

void main(void) 
{ 

setlocale (LC_ALL, "RUS"); 

printf ("%20s \n", "Это текст"); 
printf ("Это текст"); 
printf ("\vЭто текст"); 
printf ("%10.3f\n ", 12.234657); 
printf ("%10.5f\n ", 12.234657);

printf ("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2); 
printf ("Деление %d на %d равно %f\n ", 7.0, 5.0, 7. / 5); 
printf ("Умножение %d на %d равно %d\n", 2000, 4, 2000 * 4); 

printf ("%g разделить %e равно %f\n ", 5., 2., 5. / 2); 
printf ("%d разделить %d равно %d\n ", 5., 2., 5. / 2); 
printf ("%f разделить %f равно %f\n ", 5., 2., 5. / 2); 
printf ("%g разделить %g равно %g\n ", 5., 2., 5. / 2); 
printf ("%e разделить %e равно %e\n ", 5., 2., 5. / 2); 



int N = 2, K = 3; 
printf ("Сейчас %d часов %d минут 00 секунд\n", N, K); 
printf ("Идёт %d минута суток\n", K); 
printf ("До полуночи осталось %d часов и %d минут\n", N, K); 
printf ("С 8:00 прошло %d секунд\n", N); 
printf ("Текущий час = %f суток и текущая минута = %f часа\n", N/24., K/60.); 



int N = 3., K = 3., M = 5.; 
printf ("%s\n", "Дано:"); 
printf ("%20d\n", N); 
printf ("%20d\n", 333); 
puts ("            ________"); 
printf ("%s\n\t", "  Ответ:"); 
printf ("    %+008.3f", N / 333.); 

}
